In [1]:
import pandas as pd
import numpy as np

In [34]:
ds = pd.read_csv('dataset.csv', sep='\t')
ds.head(3)

      Dataset
0   $117,313
1   $104,002
2   $113,038

In [35]:
ds.dtypes

Dataset    object
dtype: object

In [58]:
salary = ds['Dataset']
# salary = salary.str.replace('$', '')
# salary = salary.str.replace(',', '')
# salary = salary.astype(float)
# ds['Dataset'] = salary

In [59]:
ds.head(3)

    Dataset
0  117313.0
1  104002.0
2  113038.0

In [111]:
ds_mean = round((sum(salary)/len(salary)), 2)
ds_mean

100200.37

In [97]:
ds_population_variance = round((np.sum((salary-ds_mean)**2)/len(salary)),2) 
ds_population_variance

127362013.63

In [98]:
ds_population_std = round((pow(ds_variance, 1/2)),2)
ds_population_std

11478.41

###standard error = standard_deviation / âˆšn

In [103]:
ds_standard_error = round((ds_std/pow((len(salary)),1/2)),2)

In [104]:
ds_standard_error

2095.66

###Find the appropriate z-score for calculating a 90% confidence interval
###[sample_mean - Z of alpha/2 * standard_error. sample_mean + Z of alpha/2 * standard_error]

###alpha is 10% = 0.1,  Z of alpha/2 is Z of 0.05
###Z is 1 - 0.05 = 0.950, by z-table corresponds to 1.6 and 0.05
###So Z of 0.05 = 1.6 + 0.05 = 1.65

In [118]:
confidence_90_min = round((ds_mean - 1.65 * ds_standard_error),2)
confidence_90_max = round((ds_mean + 1.65 * ds_standard_error),2)

In [119]:
print(f'90% confidence interval is [{confidence_90_min}, {confidence_90_max}]')

90% confidence interval is [96742.53, 103658.21]